Java 继承
继承就是子类继承父类，使得子类具有父类的实例域和方法对象，或从子类继承父类方法，使得子类具有父类的相同的行为。

继承类型
需要注意的是 Java 不支持多继承，但支持多重继承。
例如：
多重继承：
1.public class A extends B
2.public class B extends C

不同类继承同一个类
1.public B extends A
2.public C extends A

但是类是不支持多继承的
原因：
网上大多的一个说法，假如有类A,B,C,D; 类B,C继承A，并从写了自己的方法，现在D 进来了，实现多重继承，继承B和C
那么问题来了，D需要重写他的方法，那么他的方法是从谁上面去继承呢，这里就会出现分歧。
所以也就出现了我们后来类可以实现多个接口的问题了。


继承的特性
1.子类可以拥有父类非private 的方法和属性
2.子类可以拥有自己的方法和属性，即可以对父类进行推展
3.子类可以用自己的方式实现父类的方法
4.Java 的继承是单继承，但是可以多重继承，单继承就是一个子类只能继承一个父类，多重继承就是，
例如 A 类继承 B 类，B 类继承 C 类，所以按照关系就是 C 类是 B 类的父类，B 类是 A 类的父类，这是 Java 继承区别于 C++ 继承的一个特性。
5.提高了类之间的耦合性（继承的缺点，耦合度高就会造成代码之间的联系越紧密，代码独立性越差）
